#力学问题
D_DB <- c("m", "km", "dm", "cm", "mm") #宽度d
M_DB <- c("kg", "t", "g", "mg")  #质量
T_DB <- c("s", "h", "min", "ms") #时间
S_DB <- c("m2", "dm2", "cm2")    #面积
V_DB <- c("m3", "dm3", "cm3", "mL", "L") #体积
Vs_DB <- c("m/s", "m/min", "mm/s", "km/h")#速度
Ac_DB <- c("m/s2", "m/min2", "mm/s2") #加速度
Fc_DB <- c("N", "KN") #力
Mo_DB <- c("kg*m/s", "kg*m/min")#动量
En_DB <- c("J", "kJ") #能量和功
To_DB <- c("N*m", "kgf*m", "kgf*cm", "gf*cm")#力矩
An_DB <- c("rad/s", "rad/min", "rad/ms")#角速度
Aa_DB <- c("rad/s2", "rad/min2", "rad/ms2")#角加速度
Moi_DB <- c("kg∙m2", "g∙m2")#转动惯量
De_DB <- c("kg/m3", "g/cm3")#密度
Pr_DB <- c("pa", "kpa", "mpa", "bar")#压强
Po_DB <- c("J/s,KJ/S") #力学中的功率
U_DB#粘性系数
#------------------------------------------------------------------------------热学特有单位
Seta_DB <- c("C")  #温度
Shc_DB <- c("J/(kg*C)","J/(g*C)","kJ/(kg*C") #比热容
Coc_DB <- c("W/m*C","W/cm*C","kW/m*C") #热导率
Crxs_DB <- c("W/m2*C","kW/m2*C")       #传热系数
#------------------------------------------------------------------------------电学特有单位
II_DB <-c("A","mA","uA")      #电流
QQ_DB <- c("c")               #电量
VV_DB <- c("V","kV","mV")     #电压 、电位、电动势
RR_DB <-c("Ω","MΩ","kΩ","mΩ") #电阻
FF_DB <- c("F","uF")          #电容
Po_DB <- c("J/s,KJ/S") #功率
MF_DB <- c("Wb")       #磁通量
HH_DB <- c("H","mH")   #电感
Mfd_DB <-c("T")        #磁通量密度
#------------------------------------------------------------------------------上面是单位 下面是单位转化为国际单位制
Dch_DB <- c(1, 1000, 0.1, 0.01, 0.001) #宽度D
Mch_DB <- c(1, 1000, 0.001, 0.000001) #质量
tch_DB <- c(1, 3600, 60, 0.001) #时间
Sch_DB <- c(1, 0.01, 0.0001)#面积
Vch_DB <- c(1, 0.001, 0.000001, 0.000001, 0.001) #体积
Vsch_DB  <- c(1, 0.01666667, 0.001, 0.2777777777778) #速度
Acch_DB <- c(1, 0.0002777778, 0.001) #加速度
Fcch_DB <- c(1, 1000) #力
Moch_DB <- c(1, 0.01666667)#动量
Ench_DB <- c(1, 1000) #能量和功
Toch_DB <- c(1, 0.101972, 10.1972, 10197.2)#力矩
Anch_DB <- c(1, 0.01666667, 1000) #角速度
Aach_DB <- c(1, 0.0002777778, 1000000)  #角加速度
Moich_DB <- c(1, 0.001)#转动惯量
Dech_DB <- c(1, 1000)#密度
Prch_DB <- c(1, 1000, 1000000,100000)#压强
Poch_DB <- c(1,1000) #力学中的功率
#------------------------------------------------------------------------------热学特有进度转化
Setach_DB <- c(1)  #温度
Shcch_DB <- c(1,1000,1000) #比热容
Cocch_DB <- c(1,100,1000)  #热导率
Crxsch_DB <- c(1,1000)     #传热系数
#------------------------------------------------------------------------------电学特有进度转化
QQch_DB <- c(1)  #电量
IIch_DB <-c(1,0.001,0.000001)      #电流
VVch_DB <- c(1,1000,0.001,0.000001)#电压
RRch_DB <-c(1,1000000,1000,0.001)  #电阻
FFch_DB <- c(1,1000000)   #电容
Poch_DB <- c(1,1000)      #功率
MFch_DB <- c(1)           #磁通量
HHch_DB <- c(1,0.001)     #电感
Mfdch_DB <-c(1)           #磁通量密度







